#### BeforeExecutedEventArgs Members

---

|  |
| --- |
| BeforeExecutedEventArgs Class   Methods   Properties   See Also |

The  BeforeExecutedEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ActiveDocument | The active document. (Inherited from  CommandEventArgs  .) |
| Public property | Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it. (Inherited from  RevitEventArgs  .) |
| Public property | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from  RevitEventArgs  .) |
| Public property | CommandId | The command id. (Inherited from  CommandEventArgs  .) |
| Public property | UsingCommandData | Indicates whether or not the Revit journal will include custom data populated by the application associated with this command. |

# See Also

BeforeExecutedEventArgs Class

Autodesk.Revit.UI.Events Namespace